In [1]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', 200)
pd.set_option('display.max_rows', 200)

# Monthly Ridership Main DF Cleaning

In [2]:
monthly = pd.read_csv('../capstone-data/daily/CTA_-_Ridership_-_Daily_Boarding_Totals.csv')

In [3]:
monthly.shape

(7701, 5)

In [4]:
monthly.isna().sum()

service_date      0
day_type          0
bus               0
rail_boardings    0
total_rides       0
dtype: int64

In [5]:
monthly.tail()

     service_date day_type     bus  rail_boardings  total_rides
7696   11/26/2021        W  257700          189694       447394
7697   11/27/2021        A  237839          187065       424904
7698   11/28/2021        U  184817          147830       332647
7699   11/29/2021        W  421322          276090       697412
7700   11/30/2021        W  450230          302349       752579

In [6]:
monthly.dtypes

service_date      object
day_type          object
bus                int64
rail_boardings     int64
total_rides        int64
dtype: object

In [7]:
monthly.drop(columns={'day_type'},inplace=True)
monthly.rename(columns={'service_date':'date','rail_boardings':'rail'},inplace=True)

In [8]:
monthly['date']= pd.to_datetime(monthly['date'])
monthly.set_index('date',inplace=True)
monthly.sort_index(inplace=True)

In [9]:
monthly.dtypes

bus            int64
rail           int64
total_rides    int64
dtype: object

In [10]:
monthly.head()

               bus    rail  total_rides
date
2001-01-01  297192  126455       423647
2001-01-02  780827  501952      1282779
2001-01-03  824923  536432      1361355
2001-01-04  870021  550011      1420032
2001-01-05  890426  557917      1448343

In [13]:
df=monthly.resample('MS').sum()

In [14]:
df.head()

                 bus      rail  total_rides
date
2001-01-01  25022908  14712334     39735242
2001-02-01  23768892  13669269     37438161
2001-03-01  26827165  15463578     42290743
2001-04-01  25053791  14713336     39767127
2001-05-01  26743744  15743730     42487474

In [16]:
df.tail()

                 bus     rail  total_rides
date
2021-07-01  10605134  7987466     18592600
2021-08-01  10949681  8061195     19010876
2021-09-01  12058765  8988251     21047016
2021-10-01  11905629  9029274     20934903
2021-11-01  10923926  8020686     18944612

In [17]:
df=df.astype(float)

In [18]:
df.dtypes

bus            float64
rail           float64
total_rides    float64
dtype: object

In [19]:
df.sort_index(inplace=True)

In [20]:
df

                   bus        rail  total_rides
date
2001-01-01  25022908.0  14712334.0   39735242.0
2001-02-01  23768892.0  13669269.0   37438161.0
2001-03-01  26827165.0  15463578.0   42290743.0
2001-04-01  25053791.0  14713336.0   39767127.0
2001-05-01  26743744.0  15743730.0   42487474.0
...                ...         ...          ...
2021-07-01  10605134.0   7987466.0   18592600.0
2021-08-01  10949681.0   8061195.0   19010876.0
2021-09-01  12058765.0   8988251.0   21047016.0
2021-10-01  11905629.0   9029274.0   20934903.0
2021-11-01  10923926.0   8020686.0   18944612.0

[251 rows x 3 columns]

In [22]:
#df.to_csv('../capstone-data/cta-monthly-primary.csv')

In [23]:
#df= pd.read_csv('../capstone-data/cta-monthly-primary')